export const FACULTIES_BY_GROUP = [
  {
    group: 'กลุ่มวิทยาศาสตร์สุขภาพ',
    faculties: [
      'คณะแพทยศาสตร์',
      'คณะพยาบาลศาสตร์',
      'คณะทันตแพทยศาสตร์',
      'คณะเภสัชศาสตร์',
      'คณะเทคนิคการแพทย์',
      'คณะการแพทย์แผนไทย',
      'คณะสัตวแพทยศาสตร์',
    ],
  },
  {
    group: 'กลุ่มวิทยาศาสตร์และเทคโนโลยี / เกษตรศาสตร์',
    faculties: [
      'คณะวิศวกรรมศาสตร์',
      'คณะวิทยาศาสตร์',
      'คณะทรัพยากรธรรมชาติ',
      'คณะอุตสาหกรรมเกษตร',
      'คณะการจัดการสิ่งแวดล้อม',
    ],
  },
  {
    group: 'กลุ่มมนุษยศาสตร์ สังคมศาสตร์ และบริหาร',
    faculties: [
      'คณะวิทยาการจัดการ',
      'คณะศิลปศาสตร์',
      'คณะนิติศาสตร์',
      'คณะเศรษฐศาสตร์',
      'คณะการสื่อสารมวลชน',
      'คณะอื่น ๆ',
    ],
  },
];

export const FACULTIES = FACULTIES_BY_GROUP.flatMap((g) => g.faculties);
